{
  "architectures": [
    "ElectraForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "embedding_size": 768,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "\ubd88\ud3c9/\ubd88\ub9cc",
    "1": "\ud658\uc601/\ud638\uc758",
    "2": "\uac10\ub3d9/\uac10\ud0c4",
    "3": "\uc9c0\uae0b\uc9c0\uae0b",
    "4": "\uace0\ub9c8\uc6c0",
    "5": "\uc2ac\ud514",
    "6": "\ud654\ub0a8/\ubd84\ub178",
    "7": "\uc874\uacbd",
    "8": "\uae30\ub300\uac10",
    "9": "\uc6b0\ucb50\ub310/\ubb34\uc2dc\ud568",
    "10": "\uc548\ud0c0\uae4c\uc6c0/\uc2e4\ub9dd",
    "11": "\ube44\uc7a5\ud568",
    "12": "\uc758\uc2ec/\ubd88\uc2e0",
    "13": "\ubfcc\ub4ef\ud568",
    "14": "\ud3b8\uc548/\ucf8c\uc801",
    "15": "\uc2e0\uae30\ud568/\uad00\uc2ec",
    "16": "\uc544\uaef4\uc8fc\ub294",
    "17": "\ubd80\ub044\ub7ec\uc6c0",
    "18": "\uacf5\ud3ec/\ubb34\uc11c\uc6c0",
    "19": "\uc808\ub9dd",
    "20": "\ud55c\uc2ec\ud568",
    "21": "\uc5ed\uaca8\uc6c0/\uc9d5\uadf8\ub7ec\uc6c0",
    "22": "\uc9dc\uc99d",
    "23": "\uc5b4\uc774\uc5c6\uc74c",
    "24": "\uc5c6\uc74c",
    "25": "\ud328\ubc30/\uc790\uae30\ud610\uc624",
    "26": "\uadc0\ucc2e\uc74c",
    "27": "\ud798\ub4e6/\uc9c0\uce68",
    "28": "\uc990\uac70\uc6c0/\uc2e0\ub0a8",
    "29": "\uae68\ub2ec\uc74c",
    "30": "\uc8c4\ucc45\uac10",
    "31": "\uc99d\uc624/\ud610\uc624",
    "32": "\ud750\ubb47\ud568(\uadc0\uc5ec\uc6c0/\uc608\uc068)",
    "33": "\ub2f9\ud669/\ub09c\ucc98",
    "34": "\uacbd\uc545",
    "35": "\ubd80\ub2f4/\uc548_\ub0b4\ud0b4",
    "36": "\uc11c\ub7ec\uc6c0",
    "37": "\uc7ac\ubbf8\uc5c6\uc74c",
    "38": "\ubd88\uc30d\ud568/\uc5f0\ubbfc",
    "39": "\ub180\ub78c",
    "40": "\ud589\ubcf5",
    "41": "\ubd88\uc548/\uac71\uc815",
    "42": "\uae30\uc068",
    "43": "\uc548\uc2ec/\uc2e0\ub8b0"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "\uac10\ub3d9/\uac10\ud0c4": 2,
    "\uacbd\uc545": 34,
    "\uace0\ub9c8\uc6c0": 4,
    "\uacf5\ud3ec/\ubb34\uc11c\uc6c0": 18,
    "\uadc0\ucc2e\uc74c": 26,
    "\uae30\ub300\uac10": 8,
    "\uae30\uc068": 42,
    "\uae68\ub2ec\uc74c": 29,
    "\ub180\ub78c": 39,
    "\ub2f9\ud669/\ub09c\ucc98": 33,
    "\ubd80\ub044\ub7ec\uc6c0": 17,
    "\ubd80\ub2f4/\uc548_\ub0b4\ud0b4": 35,
    "\ubd88\uc30d\ud568/\uc5f0\ubbfc": 38,
    "\ubd88\uc548/\uac71\uc815": 41,
    "\ubd88\ud3c9/\ubd88\ub9cc": 0,
    "\ube44\uc7a5\ud568": 11,
    "\ubfcc\ub4ef\ud568": 13,
    "\uc11c\ub7ec\uc6c0": 36,
    "\uc2ac\ud514": 5,
    "\uc2e0\uae30\ud568/\uad00\uc2ec": 15,
    "\uc544\uaef4\uc8fc\ub294": 16,
    "\uc548\uc2ec/\uc2e0\ub8b0": 43,
    "\uc548\ud0c0\uae4c\uc6c0/\uc2e4\ub9dd": 10,
    "\uc5b4\uc774\uc5c6\uc74c": 23,
    "\uc5c6\uc74c": 24,
    "\uc5ed\uaca8\uc6c0/\uc9d5\uadf8\ub7ec\uc6c0": 21,
    "\uc6b0\ucb50\ub310/\ubb34\uc2dc\ud568": 9,
    "\uc758\uc2ec/\ubd88\uc2e0": 12,
    "\uc7ac\ubbf8\uc5c6\uc74c": 37,
    "\uc808\ub9dd": 19,
    "\uc874\uacbd": 7,
    "\uc8c4\ucc45\uac10": 30,
    "\uc990\uac70\uc6c0/\uc2e0\ub0a8": 28,
    "\uc99d\uc624/\ud610\uc624": 31,
    "\uc9c0\uae0b\uc9c0\uae0b": 3,
    "\uc9dc\uc99d": 22,
    "\ud328\ubc30/\uc790\uae30\ud610\uc624": 25,
    "\ud3b8\uc548/\ucf8c\uc801": 14,
    "\ud55c\uc2ec\ud568": 20,
    "\ud589\ubcf5": 40,
    "\ud654\ub0a8/\ubd84\ub178": 6,
    "\ud658\uc601/\ud638\uc758": 1,
    "\ud750\ubb47\ud568(\uadc0\uc5ec\uc6c0/\uc608\uc068)": 32,
    "\ud798\ub4e6/\uc9c0\uce68": 27
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "electra",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "multi_label_classification",
  "summary_activation": "gelu",
  "summary_last_dropout": 0.1,
  "summary_type": "first",
  "summary_use_proj": true,
  "tokenizer_class": "BertTokenizer",
  "torch_dtype": "float32",
  "transformers_version": "4.51.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 50135
}
